In [1]:
Data={"Name":["Shiva","Shankar","Kumar","Tarun","Rohoth"],"Age":[20,21,23,21,24],"Course":["B.Tech","M.Tech","Diploma","Degree","IIT"]}

In [2]:
import pandas as pd
import numpy as np
student_data=pd.DataFrame(Data)

In [3]:
student_data

      Name  Age   Course
0    Shiva   20   B.Tech
1  Shankar   21   M.Tech
2    Kumar   23  Diploma
3    Tarun   21   Degree
4   Rohoth   24      IIT

In [4]:
student_data[student_data["Age"]>21]

     Name  Age   Course
2   Kumar   23  Diploma
4  Rohoth   24      IIT

In [6]:
student_data["Name"]

0      Shiva
1    Shankar
2      Kumar
3      Tarun
4     Rohoth
Name: Name, dtype: object

In [15]:
student_data.iloc[0]

Name       Shiva
Age           20
Course    B.Tech
Name: 0, dtype: object

In [16]:
student_data.head()

      Name  Age   Course
0    Shiva   20   B.Tech
1  Shankar   21   M.Tech
2    Kumar   23  Diploma
3    Tarun   21   Degree
4   Rohoth   24      IIT

In [17]:
student_data["Age"].unique()

array([20, 21, 23, 24], dtype=int64)

In [18]:
student_data.to_csv("stud.csv")